tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18877_tdd.h
#define CCPR3H_RH                     1091
#define CCP3CON                       1092
#define CCP3CON_MODE0                 1093
#define CCP3MODE0                     1094
#define CCP3CON_MODE                  1095
#define CCP3MODE                      1096
#define CCP3CON_MODE1                 1097
#define CCP3MODE1                     1098
#define CCP3CON_MODE2                 1099
#define CCP3MODE2                     1100
#define CCP3CON_MODE3                 1101
#define CCP3MODE3                     1102
#define CCP3CON_FMT                   1103
#define CCP3FMT                       1104
#define CCP3CON_OUT                   1105
#define CCP3OUT                       1106
#define CCP3OE                        1107
#define CCP3CON_OE                    1108
#define CCP3EN                        1109
#define CCP3CON_EN                    1110
#define CCP3CAP                       1111
#define CCP3CAP_CTS0                  1112
#define CCP3CTS                       1113
#define CCP3CAP_CTS                   1114
#define CCP3CTS0                      1115
#define CCP3CAP_CTS1                  1116
#define CCP3CTS1                      1117
#define CCP3CAP_CTS2                  1118
#define CCP3CTS2                      1119
#define CCPR4L                        1120
#define CCPR4L_RL                     1121
#define CCPR4H                        1122
#define CCPR4H_RH                     1123
#define CCP4CON                       1124
#define CCP4MODE                      1125
#define CCP4CON_MODE0                 1126
#define CCP4CON_MODE                  1127
#define CCP4MODE0                     1128
#define CCP4CON_MODE1                 1129
#define CCP4MODE1                     1130
#define CCP4CON_MODE2                 1131
#define CCP4MODE2                     1132
#define CCP4CON_MODE3                 1133
#define CCP4MODE3                     1134
#define CCP4FMT                       1135
#define CCP4CON_FMT                   1136
#define CCP4CON_OUT                   1137
#define CCP4OUT                       1138
#define CCP4OE                        1139
#define CCP4CON_OE                    1140
#define CCP4EN                        1141
#define CCP4CON_EN                    1142
#define CCP4CAP                       1143
#define CCP4CAP_CTS0                  1144
#define CCP4CTS                       1145
#define CCP4CAP_CTS                   1146
#define CCP4CTS0                      1147
#define CCP4CAP_CTS1                  1148
#define CCP4CTS1                      1149
#define CCP4CAP_CTS2                  1150
#define CCP4CTS2                      1151
#define CCPR5L                        1152
#define CCPR5L_RL                     1153
#define CCPR5H                        1154
#define CCPR5H_RH                     1155
#define CCP5CON                       1156
#define CCP5CON_MODE                  1157
#define CCP5MODE                      1158
#define CCP5MODE0                     1159
#define CCP5CON_MODE0                 1160
#define CCP5MODE1                     1161
#define CCP5CON_MODE1                 1162
#define CCP5MODE2                     1163
#define CCP5CON_MODE2                 1164
#define CCP5MODE3                     1165
#define CCP5CON_MODE3                 1166
#define CCP5FMT                       1167
#define CCP5CON_FMT                   1168
#define CCP5CON_OUT                   1169
#define CCP5OUT                       1170
#define CCP5CON_OE                    1171
#define CCP5OE                        1172
#define CCP5EN                        1173
#define CCP5CON_EN                    1174
#define CCP5CAP                       1175
#define CCP5CAP_CTS                   1176
#define CCP5CTS0                      1177
#define CCP5CAP_CTS0                  1178
#define CCP5CTS                       1179
#define CCP5CTS1                      1180
#define CCP5CAP_CTS1                  1181
#define CCP5CTS2                      1182
#define CCP5CAP_CTS2                  1183
#define PWM6DCL                       1184
#define PWM6DCL_DC                    1185
#define PWM6DCL_DC0                   1186
#define PWM6DCL_PWMPW0                1187
#define PWM6DC0                       1188
#define PWM6DCL_DC1                   1189
#define PWM6DCL_PWMPW1                1190
#define PWM6DC1                       1191
#define PWM6DCH                       1192
#define PWM6DCH_DC2                   1193
#define PWM6DCH_DC                    1194
#define PWM6DCH_PWMPW2                1195
#define PWM6DC2                       1196
#define PWM6DCH_DC3                   1197
#define PWM6DCH_PWMPW3                1198
#define PWM6DC3                       1199
#define PWM6DCH_DC4                   1200
#define PWM6DCH_PWMPW4                1201
#define PWM6DC4                       1202
#define PWM6DCH_DC5                   1203
#define PWM6DCH_PWMPW5                1204
#define PWM6DC5                       1205
#define PWM6DCH_DC6                   1206
#define PWM6DCH_PWMPW6                1207
#define PWM6DC6                       1208
#define PWM6DCH_DC7                   1209
#define PWM6DCH_PWMPW7                1210
#define PWM6DC7                       1211
#define PWM6DCH_DC8                   1212
#define PWM6DC8                       1213
#define PWM6DCH_PWMPW8                1214
#define PWM6DCH_DC9                   1215
#define PWM6DC9                       1216
#define PWM6DCH_PWMPW9                1217
#define PWM6CON                       1218
#define PWM6POL                       1219
#define PWM6CON_POL                   1220
#define PWM6OUT                       1221
#define PWM6CON_OUT                   1222
#define PWM6CON_EN                    1223
#define PWM6EN                        1224
#define PWM7DCL                       1225
#define PWM7DCL_PWMPW0                1226
#define PWM7DC0                       1227
#define PWM7DCL_DC                    1228
#define PWM7DCL_DC0                   1229
#define PWM7DCL_PWMPW1                1230
#define PWM7DC1                       1231
#define PWM7DCL_DC1                   1232
#define PWM7DCH                       1233
#define PWM7DCH_DC2                   1234
#define PWM7DCH_DC                    1235
#define PWM7DC2                       1236
#define PWM7DCH_PWMPW2                1237
#define PWM7DCH_PWMPW3                1238
#define PWM7DCH_DC3                   1239
#define PWM7DC3                       1240
#define PWM7DCH_PWMPW4                1241
#define PWM7DCH_DC4                   1242
#define PWM7DC4                       1243
#define PWM7DCH_PWMPW5                1244
#define PWM7DCH_DC5                   1245
#define PWM7DC5                       1246
#define PWM7DCH_DC6                   1247
#define PWM7DC6                       1248
#define PWM7DCH_PWMPW6                1249
#define PWM7DCH_DC7                   1250
#define PWM7DC7                       1251
#define PWM7DCH_PWMPW7                1252
#define PWM7DCH_DC8                   1253
#define PWM7DCH_PWMPW8                1254
#define PWM7DC8                       1255
#define PWM7DCH_DC9                   1256
#define PWM7DCH_PWMPW9                1257
#define PWM7DC9                       1258
#define PWM7CON                       1259
#define PWM7POL                       1260
#define PWM7CON_POL                   1261
#define PWM7CON_OUT                   1262
#define PWM7OUT                       1263
#define PWM7EN                        1264
#define PWM7CON_EN                    1265
#define SCANLADRL                     1266
#define LADR0                         1267
#define LADRL                         1268
#define SCANLADR0                     1269
#define SCANLADR1                     1270
#define LADR1                         1271
#define LADR2                         1272
#define SCANLADR2                     1273
#define LADR3                         1274
#define SCANLADR3                     1275
#define LADR4                         1276
#define SCANLADR4                     1277
#define LADR5                         1278
#define SCANLADR5                     1279
#define LADR6                         1280
#define SCANLADR6                     1281
#define LADR7                         1282
#define SCANLADR7                     1283
#define LADR8                         1284
#define SCANLADRH                     1285
#define LADRH                         1286
#define SCANLADR8                     1287
#define LADR9                         1288
#define SCANLADR9                     1289
#define LADR10                        1290
#define SCANLADR10                    1291
#define LADR11                        1292
#define SCANLADR11                    1293
#define LADR12                        1294
#define SCANLADR12                    1295
#define LADR13                        1296
#define SCANLADR13                    1297
#define LADR14                        1298
#define SCANLADR14                    1299
#define SCANLADR15                    1300
#define LADR15                        1301
#define SCANHADR0                     1302
#define HADR0                         1303
#define HADRL                         1304
#define SCANHADRL                     1305
#define SCANHADR1                     1306
#define HADR1                         1307
#define SCANHADR2                     1308
#define HADR2                         1309
#define SCANHADR3                     1310
#define HADR3                         1311
#define SCANHADR4                     1312
#define HADR4                         1313
#define SCANHADR5                     1314
#define HADR5                         1315
#define SCANHADR6                     1316
#define HADR6                         1317
#define SCANHADR7                     1318
#define HADR7                         1319
#define HADR8                         1320
#define SCANHADR8                     1321
#define HADRH                         1322
#define SCANHADRH                     1323
#define HADR9                         1324
#define SCANHADR9                     1325
#define SCANHADR10                    1326
#define HADR10                        1327
#define HADR11                        1328
#define SCANHADR11                    1329
#define HADR12                        1330
#define SCANHADR12                    1331
#define HADR13                        1332
#define SCANHADR13                    1333
#define HADR14                        1334
#define SCANHADR14                    1335
#define HADR15                        1336
#define SCANHADR15                    1337
#define SCANCON0                      1338
#define SCANMODE                      1339
#define SCANMODE0                     1340
#define SCANCON0_MODE0                1341
#define SCANCON0_MODE                 1342
#define SCANCON0_MODE1                1343
#define SCANMODE1                     1344
#define INTM                          1345
#define SCANINTM                      1346
#define DABORT                        1347
#define INVALID                       1348
#define SCANINVALID                   1349
#define SCANCON0_BUSY                 1350
#define SCANBUSY                      1351
#define SCANGO                        1352
#define SCANEN                        1353
#define SCANCON0_EN                   1354
#define SCANTRIG                      1355
#define TSEL0                         1356
#define TSEL                          1357
#define SCANTSEL0                     1358
#define SCANTSEL                      1359
#define TSEL1                         1360
#define SCANTSEL1                     1361
#define TSEL2                         1362
#define SCANTSEL2                     1363
#define TSEL3                         1364
#define SCANTSEL3                     1365
#define CRCDATL                       1366
#define DATA0                         1367
#define DATA1                         1368
#define DATA2                         1369
#define DATA3                         1370
#define DATA4                         1371
#define DATA5                         1372
#define DATA6                         1373
#define DATA7                         1374
#define CRCDATH                       1375
#define DATA8                         1376
#define DATA9                         1377
#define DATA10                        1378
#define DATA11                        1379
#define DATA12                        1380
#define DATA13                        1381
#define DATA14                        1382
#define DATA15                        1383
#define CRCACCL                       1384
#define ACC0                          1385
#define ACC1                          1386
#define ACC2                          1387
#define ACC3                          1388
#define ACC4                          1389
#define ACC5                          1390
#define ACC6                          1391
#define ACC7                          1392
#define CRCACCH                       1393
#define ACC8                          1394
#define ACC9                          1395
#define ACC10                         1396
#define ACC11                         1397
#define ACC12                         1398
#define ACC13                         1399
#define ACC14                         1400
#define ACC15                         1401
#define CRCSHIFTL                     1402
#define SHFT0                         1403
#define SHFT1                         1404
#define SHFT2                         1405
#define SHFT3                         1406
#define SHFT4                         1407
#define SHFT5                         1408
#define SHFT6                         1409
#define SHFT7                         1410
#define CRCSHIFTH                     1411
#define SHFT8                         1412
#define SHFT9                         1413
#define SHFT10                        1414
#define SHFT11                        1415
#define SHFT12                        1416
#define SHFT13                        1417
#define SHFT14                        1418
#define SHFT15                        1419
#define CRCXORL                       1420
#define X1                            1421
#define X2                            1422
#define X3                            1423
#define X4                            1424
#define X5                            1425
#define X6                            1426
#define X7                            1427
#define CRCXORH                       1428
#define X8                            1429
#define X9                            1430
#define X10                           1431
#define X11                           1432
#define X12                           1433
#define X13                           1434
#define X14                           1435
#define X15                           1436
#define CRCCON0                       1437
#define FULL                          1438
#define SHIFTM                        1439
#define ACCM                          1440
#define CRCCON0_BUSY                  1441
#define CRCGO                         1442
#define CRCCON0_EN                    1443
#define CRCEN                         1444
#define CRCCON1                       1445
#define PLEN0                         1446
#define PLEN                          1447
#define PLEN1                         1448
#define PLEN2                         1449
#define PLEN3                         1450
#define DLEN                          1451
#define DLEN0                         1452
#define DLEN1                         1453
#define DLEN2                         1454
#define DLEN3                         1455
#define SMT1TMRL                      1456
#define SMT1TMR0                      1457
#define SMT1TMRL_SMT1TMR              1458
#define SMT1TMR1                      1459
#define SMT1TMR2                      1460
#define SMT1TMR3                      1461
#define SMT1TMR4                      1462
#define SMT1TMR5                      1463
#define SMT1TMR6                      1464
#define SMT1TMR7                      1465
#define SMT1TMRH                      1466
#define SMT1TMR8                      1467
#define SMT1TMRH_SMT1TMR              1468
#define SMT1TMR9                      1469
#define SMT1TMR10                     1470
#define SMT1TMR11                     1471
#define SMT1TMR12                     1472
#define SMT1TMR13                     1473
#define SMT1TMR14                     1474
#define SMT1TMR15                     1475
#define SMT1TMRU                      1476
#define SMT1TMR16                     1477
#define SMT1TMRU_SMT1TMR              1478
#define SMT1TMR17                     1479
#define SMT1TMR18                     1480
#define SMT1TMR19                     1481
#define SMT1TMR20                     1482
#define SMT1TMR21                     1483
#define SMT1TMR22                     1484
#define SMT1TMR23                     1485
#define SMT1CPRL                      1486
#define SMT1CPRL_CPR0                 1487
#define SMT1CPRL_SMT1CPR              1488
#define SMT1CPRL_CPR                  1489
#define SMT1CPRL_CPR1                 1490
#define SMT1CPRL_CPR2                 1491
#define SMT1CPRL_CPR3                 1492
#define SMT1CPRL_CPR4                 1493
#define SMT1CPRL_CPR5                 1494
#define SMT1CPRL_CPR6                 1495
#define SMT1CPRL_CPR7                 1496
#define SMT1CPRH                      1497
#define SMT1CPRH_CPR                  1498
#define SMT1CPRH_SMT1CPR              1499
#define SMT1CPR8                      1500
#define SMT1CPRH_CPR8                 1501
#define SMT1CPRH_CPR9                 1502
#define SMT1CPR9                      1503
#define SMT1CPRH_CPR10                1504
#define SMT1CPR10                     1505
#define SMT1CPRH_CPR11                1506
#define SMT1CPR11                     1507
#define SMT1CPR12                     1508
#define SMT1CPRH_CPR12                1509
#define SMT1CPRH_CPR13                1510
#define SMT1CPR13                     1511
#define SMT1CPRH_CPR14                1512
#define SMT1CPR14                     1513
#define SMT1CPRH_CPR15                1514
#define SMT1CPR15                     1515
#define SMT1CPRU                      1516
#define SMT1CPRU_CPR16                1517
#define SMT1CPRU_SMT1CPR              1518
#define SMT1CPR16                     1519
#define SMT1CPRU_CPR                  1520
#define SMT1CPRU_CPR17                1521
#define SMT1CPR17                     1522
#define SMT1CPRU_CPR18                1523
#define SMT1CPR18                     1524
#define SMT1CPRU_CPR19                1525
#define SMT1CPR19                     1526
#define SMT1CPR20                     1527
#define SMT1CPRU_CPR20                1528
#define SMT1CPR21                     1529
#define SMT1CPRU_CPR21                1530
#define SMT1CPR22                     1531
#define SMT1CPRU_CPR22                1532
#define SMT1CPR23                     1533
#define SMT1CPRU_CPR23                1534
#define SMT1CPWL                      1535
#define SMT1CPW0                      1536
#define SMT1CPWL_CPW0                 1537
#define SMT1CPWL_CPW                  1538
#define SMT1CPWL_SMT1CPW              1539
#define SMT1CPW1                      1540
#define SMT1CPWL_CPW1                 1541
#define SMT1CPW2                      1542
#define SMT1CPWL_CPW2                 1543
#define SMT1CPW3                      1544
#define SMT1CPWL_CPW3                 1545
#define SMT1CPW4                      1546
#define SMT1CPWL_CPW4                 1547
#define SMT1CPW5                      1548
#define SMT1CPWL_CPW5                 1549
#define SMT1CPW6                      1550
#define SMT1CPWL_CPW6                 1551
#define SMT1CPW7                      1552
#define SMT1CPWL_CPW7                 1553
#define SMT1CPWH                      1554
#define SMT1CPW8                      1555
#define SMT1CPWH_CPW8                 1556
#define SMT1CPWH_SMT1CPW              1557
#define SMT1CPWH_CPW                  1558
#define SMT1CPW9                      1559
#define SMT1CPWH_CPW9                 1560
#define SMT1CPWH_CPW10                1561
#define SMT1CPW10                     1562
#define SMT1CPWH_CPW11                1563
#define SMT1CPW11                     1564
#define SMT1CPWH_CPW12                1565
#define SMT1CPW12                     1566
#define SMT1CPWH_CPW13                1567
#define SMT1CPW13                     1568
#define SMT1CPWH_CPW14                1569
#define SMT1CPW14                     1570
#define SMT1CPWH_CPW15                1571
#define SMT1CPW15                     1572
#define SMT1CPWU                      1573
#define SMT1CPWU_CPW                  1574
#define SMT1CPWU_SMT1CPW              1575
#define SMT1CPW16                     1576
#define SMT1CPWU_CPW16                1577
#define SMT1CPW17                     1578
#define SMT1CPWU_CPW17                1579
#define SMT1CPW18                     1580
#define SMT1CPWU_CPW18                1581
#define SMT1CPW19                     1582
#define SMT1CPWU_CPW19                1583
#define SMT1CPWU_CPW20                1584
#define SMT1CPW20                     1585
#define SMT1CPWU_CPW21                1586
#define SMT1CPW21                     1587
#define SMT1CPWU_CPW22                1588
#define SMT1CPW22                     1589
#define SMT1CPWU_CPW23                1590
#define SMT1CPW23                     1591
#define SMT1PRL                       1592
#define SMT1PR0                       1593
#define SMT1PRL_SMT1PR                1594
#define SMT1PR1                       1595
#define SMT1PR2                       1596
#define SMT1PR3                       1597
#define SMT1PR4                       1598
#define SMT1PR5                       1599
#define SMT1PR6                       1600
#define SMT1PR7                       1601
#define SMT1PRH                       1602
#define SMT1PR8                       1603
#define SMT1PRH_SMT1PR                1604
#define SMT1PR9                       1605
#define SMT1PR10                      1606
#define SMT1PR11                      1607
#define SMT1PR12                      1608
#define SMT1PR13                      1609
#define SMT1PR14                      1610
#define SMT1PR15                      1611
#define SMT1PRU                       1612
#define SMT1PR16                      1613
#define SMT1PRU_SMT1PR                1614
#define SMT1PR17                      1615
#define SMT1PR18                      1616
#define SMT1PR19                      1617
#define SMT1PR20                      1618
#define SMT1PR21                      1619
#define SMT1PR22                      1620
#define SMT1PR23                      1621
#define SMT1CON0                      1622
#define SMT1PS0                       1623
#define SMT1PS                        1624
#define SMT1PS1                       1625
#define SMT1CON0_CPOL                 1626
#define SMT1CON0_SPOL                 1627
#define SMT1CON0_WPOL                 1628
#define SMT1CON0_STP                  1629
#define SMT1EN                        1630
#define SMT1CON0_EN                   1631
#define SMT1CON1                      1632
#define SMT1CON1_MODE                 1633
#define SMT1CON1_MODE0                1634
#define SMT1CON1_MODE1                1635
#define SMT1CON1_MODE2                1636
#define SMT1CON1_MODE3                1637
#define SMT1CON1_REPEAT               1638
#define SMT1GO                        1639
#define SMT1STAT                      1640
#define SMT1STAT_AS                   1641
#define SMT1AS                        1642
#define SMT1STAT_WS                   1643
#define SMT1WS                        1644
#define SMT1STAT_TS                   1645
#define SMT1TS                        1646
#define SMT1RESET                     1647
#define SMT1STAT_RST                  1648
