tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18877_tdd.h
#define CWG3DBR_DBR1                  2207
#define CWG3DBR1                      2208
#define CWG3DBR_DBR2                  2209
#define CWG3DBR2                      2210
#define CWG3DBR_DBR3                  2211
#define CWG3DBR3                      2212
#define CWG3DBR_DBR4                  2213
#define CWG3DBR4                      2214
#define CWG3DBR_DBR5                  2215
#define CWG3DBR5                      2216
#define CWG3DBF0                      2217
#define CWG3DBF_DBF0                  2218
#define CWG3DBF                       2219
#define CWG3DBF_DBF                   2220
#define CWG3DBF1                      2221
#define CWG3DBF_DBF1                  2222
#define CWG3DBF2                      2223
#define CWG3DBF_DBF2                  2224
#define CWG3DBF3                      2225
#define CWG3DBF_DBF3                  2226
#define CWG3DBF4                      2227
#define CWG3DBF_DBF4                  2228
#define CWG3DBF5                      2229
#define CWG3DBF_DBF5                  2230
#define CWG3CON0                      2231
#define CWG3MODE                      2232
#define CWG3MODE0                     2233
#define CWG3CON0_MODE                 2234
#define CWG3CON0_MODE0                2235
#define CWG3MODE1                     2236
#define CWG3CON0_MODE1                2237
#define CWG3MODE2                     2238
#define CWG3CON0_MODE2                2239
#define CWG3LD                        2240
#define CWG3CON0_LD                   2241
#define G3EN                          2242
#define CWG3EN                        2243
#define CWG3CON0_EN                   2244
#define CWG3CON1                      2245
#define CWG3CON1_POLA                 2246
#define CWG3POLA                      2247
#define CWG3CON1_POLB                 2248
#define CWG3POLB                      2249
#define CWG3CON1_POLC                 2250
#define CWG3POLC                      2251
#define CWG3POLD                      2252
#define CWG3CON1_POLD                 2253
#define CWG3IN                        2254
#define CWG3CON1_IN                   2255
#define CWG3AS0                       2256
#define CWG3AS0_LSAC                  2257
#define CWG3LSAC0                     2258
#define CWG3AS0_LSAC0                 2259
#define CWG3LSAC                      2260
#define CWG3LSAC1                     2261
#define CWG3AS0_LSAC1                 2262
#define CWG3LSBD                      2263
#define CWG3AS0_LSBD                  2264
#define CWG3LSBD0                     2265
#define CWG3AS0_LSBD0                 2266
#define CWG3LSBD1                     2267
#define CWG3AS0_LSBD1                 2268
#define CWG3AS0_REN                   2269
#define CWG3REN                       2270
#define CWG3SHUTDOWN                  2271
#define CWG3AS0_SHUTDOWN              2272
#define CWG3AS1                       2273
#define CWG3AS1_AS0E                  2274
#define CWG3AS1_AS1E                  2275
#define CWG3AS1_AS2E                  2276
#define CWG3AS1_AS3E                  2277
#define CWG3AS1_AS4E                  2278
#define CWG3AS1_AS5E                  2279
#define CWG3AS1_AS6E                  2280
#define CWG3STR                       2281
#define CWG3STRA                      2282
#define CWG3STR_STRA                  2283
#define CWG3STRB                      2284
#define CWG3STR_STRB                  2285
#define CWG3STRC                      2286
#define CWG3STR_STRC                  2287
#define CWG3STR_STRD                  2288
#define CWG3STRD                      2289
#define CWG3STR_OVRA                  2290
#define CWG3OVRA                      2291
#define CWG3STR_OVRB                  2292
#define CWG3OVRB                      2293
#define CWG3STR_OVRC                  2294
#define CWG3OVRC                      2295
#define CWG3OVRD                      2296
#define CWG3STR_OVRD                  2297
#define PIR0                          2298
#define INTF                          2299
#define IOCIF                         2300
#define TMR0IF                        2301
#define PIR1                          2302
#define ADIF                          2303
#define ADTIF                         2304
#define CSWIF                         2305
#define OSFIF                         2306
#define PIR2                          2307
#define C1IF                          2308
#define C2IF                          2309
#define ZCDIF                         2310
#define PIR3                          2311
#define SSP1IF                        2312
#define BCL1IF                        2313
#define SSP2IF                        2314
#define BCL2IF                        2315
#define TXIF                          2316
#define RCIF                          2317
#define PIR4                          2318
#define TMR1IF                        2319
#define TMR2IF                        2320
#define TMR3IF                        2321
#define TMR4IF                        2322
#define TMR5IF                        2323
#define TMR6IF                        2324
#define PIR5                          2325
#define TMR1GIF                       2326
#define TMR3GIF                       2327
#define TMR5GIF                       2328
#define CLC1IF                        2329
#define CLC2IF                        2330
#define CLC3IF                        2331
#define CLC4IF                        2332
#define PIR6                          2333
#define CCP1IF                        2334
#define CCP2IF                        2335
#define CCP3IF                        2336
#define CCP4IF                        2337
#define CCP5IF                        2338
#define PIR7                          2339
#define CWG1IF                        2340
#define CWG2IF                        2341
#define CWG3IF                        2342
#define NCO1IF                        2343
#define NCOIF                         2344
#define NVMIF                         2345
#define CRCIF                         2346
#define SCANIF                        2347
#define PIR8                          2348
#define SMT1IF                        2349
#define SMT1PRAIF                     2350
#define SMT1PWAIF                     2351
#define SMT2IF                        2352
#define SMT2PRAIF                     2353
#define SMT2PWAIF                     2354
#define PIE0                          2355
#define INTE                          2356
#define IOCIE                         2357
#define TMR0IE                        2358
#define PIE1                          2359
#define ADIE                          2360
#define ADTIE                         2361
#define CSWIE                         2362
#define OSFIE                         2363
#define PIE2                          2364
#define C1IE                          2365
#define C2IE                          2366
#define ZCDIE                         2367
#define PIE3                          2368
#define SSP1IE                        2369
#define BCL1IE                        2370
#define SSP2IE                        2371
#define BCL2IE                        2372
#define TXIE                          2373
#define RCIE                          2374
#define PIE4                          2375
#define TMR1IE                        2376
#define TMR2IE                        2377
#define TMR3IE                        2378
#define TMR4IE                        2379
#define TMR5IE                        2380
#define TMR6IE                        2381
#define PIE5                          2382
#define TMR1GIE                       2383
#define TMR3GIE                       2384
#define TMR5GIE                       2385
#define CLC1IE                        2386
#define CLC2IE                        2387
#define CLC3IE                        2388
#define CLC4IE                        2389
#define PIE6                          2390
#define CCP1IE                        2391
#define CCP2IE                        2392
#define CCP3IE                        2393
#define CCP4IE                        2394
#define CCP5IE                        2395
#define PIE7                          2396
#define CWG1IE                        2397
#define CWG2IE                        2398
#define CWG3IE                        2399
#define NCO1IE                        2400
#define NCOIE                         2401
#define NVMIE                         2402
#define CRCIE                         2403
#define SCANIE                        2404
#define PIE8                          2405
#define SMT1IE                        2406
#define SMT1PRAIE                     2407
#define SMT1PWAIE                     2408
#define SMT2IE                        2409
#define SMT2PRAIE                     2410
#define SMT2PWAIE                     2411
#define PMD0                          2412
#define IOCMD                         2413
#define CLKRMD                        2414
#define NVMMD                         2415
#define SCANMD                        2416
#define CRCMD                         2417
#define FVRMD                         2418
#define SYSCMD                        2419
#define PMD1                          2420
#define TMR0MD                        2421
#define TMR1MD                        2422
#define TMR2MD                        2423
#define TMR3MD                        2424
#define TMR4MD                        2425
#define TMR5MD                        2426
#define TMR6MD                        2427
#define NCOMD                         2428
#define NCO1MD                        2429
#define PMD2                          2430
#define ZCDMD                         2431
#define CMP1MD                        2432
#define CMP2MD                        2433
#define ADCMD                         2434
#define DACMD                         2435
#define PMD3                          2436
#define CCP1MD                        2437
#define CCP2MD                        2438
#define CCP3MD                        2439
#define CCP4MD                        2440
#define CCP5MD                        2441
#define PWM6MD                        2442
#define PWM7MD                        2443
#define PMD4                          2444
#define CWG1MD                        2445
#define CWG2MD                        2446
#define CWG3MD                        2447
#define MSSP1MD                       2448
#define MSSP2MD                       2449
#define UART1MD                       2450
#define PMD5                          2451
#define DSMMD                         2452
#define CLC1MD                        2453
#define CLC2MD                        2454
#define CLC3MD                        2455
#define CLC4MD                        2456
#define SMT1MD                        2457
#define SMT2MD                        2458
#define WDTCON0                       2459
#define WDTCON0_SEN                   2460
#define SWDTEN                        2461
#define WDTSEN                        2462
#define WDTPS                         2463
#define WDTPS0                        2464
#define WDTPS1                        2465
#define WDTPS2                        2466
#define WDTPS3                        2467
#define WDTPS4                        2468
#define WDTCON1                       2469
#define WDTWINDOW0                    2470
#define WINDOW0                       2471
#define WINDOW                        2472
#define WDTWINDOW                     2473
#define WDTWINDOW1                    2474
#define WINDOW1                       2475
#define WDTWINDOW2                    2476
#define WINDOW2                       2477
#define WDTCS                         2478
#define WDTCS0                        2479
#define WDTCS1                        2480
#define WDTCS2                        2481
#define WDTPSL                        2482
#define WDTPSL_WDTPSCNT               2483
#define WDTPSL_PSCNT                  2484
#define WDTPSCNT0                     2485
#define PSCNT0                        2486
#define WDTPSCNT1                     2487
#define PSCNT1                        2488
#define WDTPSCNT2                     2489
#define PSCNT2                        2490
#define WDTPSCNT3                     2491
#define PSCNT3                        2492
#define WDTPSCNT4                     2493
#define PSCNT4                        2494
#define WDTPSCNT5                     2495
#define PSCNT5                        2496
#define WDTPSCNT6                     2497
#define PSCNT6                        2498
#define WDTPSCNT7                     2499
#define PSCNT7                        2500
#define WDTPSH                        2501
#define PSCNT8                        2502
#define WDTPSH_WDTPSCNT               2503
#define WDTPSH_PSCNT                  2504
#define WDTPSCNT8                     2505
#define PSCNT9                        2506
#define WDTPSCNT9                     2507
#define PSCNT10                       2508
#define WDTPSCNT10                    2509
#define PSCNT11                       2510
#define WDTPSCNT11                    2511
#define PSCNT12                       2512
#define WDTPSCNT12                    2513
#define PSCNT13                       2514
#define WDTPSCNT13                    2515
#define PSCNT14                       2516
#define WDTPSCNT14                    2517
#define PSCNT15                       2518
#define WDTPSCNT15                    2519
#define PSCNT16                       2520
#define WDTPSCNT16                    2521
#define WDTPSCNT17                    2522
#define PSCNT17                       2523
#define STATE                         2524
#define WDTSTATE                      2525
#define WDTTMR                        2526
#define WDTTMR0                       2527
#define WDTTMR1                       2528
#define WDTTMR2                       2529
#define WDTTMR3                       2530
#define BORCON                        2531
#define BORRDY                        2532
#define SBOREN                        2533
#define PCON0                         2534
#define nBOR                          2535
#define nPOR                          2536
#define nRI                           2537
#define nRMCLR                        2538
#define nRWDT                         2539
#define nWDTWV                        2540
#define STKUNF                        2541
#define STKOVF                        2542
#define CCDCON                        2543
#define CCDS0                         2544
#define CCDS1                         2545
#define CCDEN                         2546
#define NVMADRL                       2547
#define NVMADR0                       2548
#define NVMADR1                       2549
#define NVMADR2                       2550
#define NVMADR3                       2551
#define NVMADR4                       2552
#define NVMADR5                       2553
#define NVMADR6                       2554
#define NVMADR7                       2555
#define NVMADRH                       2556
#define NVMADR8                       2557
#define NVMADR9                       2558
#define NVMADR10                      2559
#define NVMADR11                      2560
#define NVMADR12                      2561
#define NVMADR13                      2562
#define NVMADR14                      2563
#define NVMDATL                       2564
#define NVMDAT0                       2565
#define NVMDAT1                       2566
#define NVMDAT2                       2567
#define NVMDAT3                       2568
#define NVMDAT4                       2569
#define NVMDAT5                       2570
#define NVMDAT6                       2571
#define NVMDAT7                       2572
#define NVMDATH                       2573
#define NVMDAT8                       2574
#define NVMDAT9                       2575
#define NVMDAT10                      2576
#define NVMDAT11                      2577
#define NVMDAT12                      2578
#define NVMDAT13                      2579
#define NVMCON1                       2580
#define RD                            2581
#define WR                            2582
#define WREN                          2583
#define WRERR                         2584
#define FREE                          2585
#define LWLO                          2586
#define NVMREGS                       2587
#define CPUDOZE                       2588
#define DOZE0                         2589
#define DOZE1                         2590
#define DOZE2                         2591
#define DOE                           2592
#define ROI                           2593
#define DOZEN                         2594
#define IDLEN                         2595
#define OSCCON1                       2596
#define NDIV0                         2597
#define NDIV                          2598
#define NDIV1                         2599
#define NDIV2                         2600
#define NDIV3                         2601
#define NOSC0                         2602
#define NOSC                          2603
#define NOSC1                         2604
#define NOSC2                         2605
#define OSCCON2                       2606
#define CDIV0                         2607
#define CDIV                          2608
#define CDIV1                         2609
#define CDIV2                         2610
#define CDIV3                         2611
#define COSC                          2612
#define COSC0                         2613
#define COSC1                         2614
#define COSC2                         2615
#define OSCCON3                       2616
#define NOSCR                         2617
#define ORDY                          2618
#define SOSCPWR                       2619
#define CSWHOLD                       2620
#define OSCSTAT                       2621
#define PLLR                          2622
#define ADOR                          2623
#define SOR                           2624
#define LFOR                          2625
#define MFOR                          2626
#define HFOR                          2627
#define EXTOR                         2628
#define OSCEN                         2629
#define ADOEN                         2630
#define SOSCEN                        2631
#define LFOEN                         2632
#define MFOEN                         2633
#define HFOEN                         2634
#define EXTOEN                        2635
#define OSCTUNE                       2636
#define HFTUN0                        2637
#define HFTUN                         2638
#define HFTUN1                        2639
#define HFTUN2                        2640
#define HFTUN3                        2641
#define HFTUN4                        2642
#define HFTUN5                        2643
#define OSCFRQ                        2644
#define HFFRQ                         2645
#define HFFRQ0                        2646
#define HFFRQ1                        2647
#define HFFRQ2                        2648
#define CLKRCON                       2649
#define CLKRDIV                       2650
#define CLKRDIV0                      2651
#define CLKRDIV1                      2652
#define CLKRDIV2                      2653
#define CLKRDC                        2654
#define CLKRDC0                       2655
#define CLKRDC1                       2656
#define CLKREN                        2657
#define CLKRCLK                       2658
#define CLKRCLK0                      2659
#define CLKRCLK1                      2660
#define CLKRCLK2                      2661
#define CLKRCLK3                      2662
#define MDCON0                        2663
#define MDBIT                         2664
#define MDOPOL                        2665
#define MDOUT                         2666
#define MDEN                          2667
#define MDCON1                        2668
#define MDCLSYNC                      2669
#define MDCLPOL                       2670
#define MDCHSYNC                      2671
#define MDCHPOL                       2672
#define MDSRC                         2673
#define MDMS0                         2674
#define MDMS                          2675
#define MDMS1                         2676
#define MDMS2                         2677
#define MDMS3                         2678
#define MDMS4                         2679
#define MDCARL                        2680
#define MDCL0                         2681
#define MDCL                          2682
#define MDCL1                         2683
#define MDCL2                         2684
#define MDCL3                         2685
#define MDCARH                        2686
#define MDCH                          2687
#define MDCH0                         2688
#define MDCH1                         2689
#define MDCH2                         2690
#define MDCH3                         2691
#define FVRCON                        2692
#define ADFVR0                        2693
#define ADFVR                         2694
#define ADFVR1                        2695
#define CDAFVR                        2696
#define CDAFVR0                       2697
#define CDAFVR1                       2698
#define TSRNG                         2699
#define TSEN                          2700
#define FVRRDY                        2701
#define FVREN                         2702
#define DAC1CON0                      2703
#define NSS                           2704
#define DAC1NSS                       2705
#define DAC1PSS0                      2706
#define PSS                           2707
#define PSS0                          2708
#define PSS1                          2709
#define DAC1PSS1                      2710
#define OE2                           2711
#define DAC1OE2                       2712
#define OE1                           2713
#define DAC1OE1                       2714
#define DAC1CON0_EN                   2715
#define DAC1EN                        2716
#define DAC1CON1                      2717
#define DAC1R                         2718
#define DAC1R0                        2719
#define DAC1R1                        2720
#define DAC1R2                        2721
#define DAC1R3                        2722
#define DAC1R4                        2723
#define ZCDCON                        2724
#define ZCDINTN                       2725
#define ZCDINTP                       2726
#define ZCDPOL                        2727
#define ZCDOUT                        2728
#define ZCDSEN                        2729
#define CMOUT                         2730
#define CMOUT_C1OUT                   2731
#define MC1OUT                        2732
#define MC2OUT                        2733
#define CMOUT_C2OUT                   2734
#define CM1CON0                       2735
#define CM1CON0_SYNC                  2736
#define C1SYNC                        2737
#define CM1CON0_HYS                   2738
#define C1HYS                         2739
#define C1SP                          2740
#define CM1CON0_POL                   2741
#define C1POL                         2742
#define CM1CON0_OUT                   2743
#define CM1CON0_C1OUT                 2744
#define CM1CON0_ON                    2745
#define C1ON                          2746
#define CM1CON1                       2747
#define C1INTN                        2748
#define CM1CON1_INTN                  2749
#define CM1CON1_INTP                  2750
#define C1INTP                        2751
#define CM1NSEL                       2752
#define CM1NSEL_NCH0                  2753
#define C1NCH0                        2754
#define CM1NSEL_NCH                   2755
#define C1NCH                         2756
#define CM1NSEL_NCH1                  2757
#define C1NCH1                        2758
#define CM1NSEL_NCH2                  2759
#define C1NCH2                        2760
#define CM1PSEL                       2761
#define CM1PSEL_PCH                   2762
#define C1PCH                         2763
#define C1PCH0                        2764
