tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18877_tdd.h
#define CM1PSEL_PCH0                  2765
#define C1PCH1                        2766
#define CM1PSEL_PCH1                  2767
#define C1PCH2                        2768
#define CM1PSEL_PCH2                  2769
#define CM2CON0                       2770
#define CM2CON0_SYNC                  2771
#define C2SYNC                        2772
#define C2HYS                         2773
#define CM2CON0_HYS                   2774
#define C2SP                          2775
#define C2POL                         2776
#define CM2CON0_POL                   2777
#define CM2CON0_C2OUT                 2778
#define CM2CON0_OUT                   2779
#define CM2CON0_ON                    2780
#define C2ON                          2781
#define CM2CON1                       2782
#define C2INTN                        2783
#define CM2CON1_INTN                  2784
#define CM2CON1_INTP                  2785
#define C2INTP                        2786
#define CM2NSEL                       2787
#define C2NCH0                        2788
#define CM2NSEL_NCH0                  2789
#define C2NCH                         2790
#define CM2NSEL_NCH                   2791
#define C2NCH1                        2792
#define CM2NSEL_NCH1                  2793
#define C2NCH2                        2794
#define CM2NSEL_NCH2                  2795
#define CM2PSEL                       2796
#define CM2PSEL_PCH                   2797
#define C2PCH                         2798
#define C2PCH0                        2799
#define CM2PSEL_PCH0                  2800
#define C2PCH1                        2801
#define CM2PSEL_PCH1                  2802
#define CM2PSEL_PCH2                  2803
#define C2PCH2                        2804
#define CLCDATA                       2805
#define MLC1OUT                       2806
#define MLC2OUT                       2807
#define MLC3OUT                       2808
#define MLC4OUT                       2809
#define CLC1CON                       2810
#define CLC1CON_MODE                  2811
#define LC1MODE0                      2812
#define LC1MODE                       2813
#define CLC1CON_MODE0                 2814
#define LC1MODE1                      2815
#define CLC1CON_MODE1                 2816
#define LC1MODE2                      2817
#define CLC1CON_MODE2                 2818
#define LC1INTN                       2819
#define CLC1CON_INTN                  2820
#define LC1INTP                       2821
#define CLC1CON_INTP                  2822
#define LC1OUT                        2823
#define CLC1CON_OUT                   2824
#define LC1EN                         2825
#define CLC1CON_EN                    2826
#define CLC1POL                       2827
#define LC1G1POL                      2828
#define CLC1POL_G1POL                 2829
#define CLC1POL_G2POL                 2830
#define LC1G2POL                      2831
#define LC1G3POL                      2832
#define CLC1POL_G3POL                 2833
#define LC1G4POL                      2834
#define CLC1POL_G4POL                 2835
#define CLC1POL_POL                   2836
#define LC1POL                        2837
#define CLC1SEL0                      2838
#define LC1D1S                        2839
#define CLC1SEL0_D1S0                 2840
#define LC1D1S0                       2841
#define CLC1SEL0_D1S                  2842
#define CLC1SEL0_D1S1                 2843
#define LC1D1S1                       2844
#define CLC1SEL0_D1S2                 2845
#define LC1D1S2                       2846
#define CLC1SEL0_D1S3                 2847
#define LC1D1S3                       2848
#define LC1D1S4                       2849
#define CLC1SEL0_D1S4                 2850
#define CLC1SEL0_D1S5                 2851
#define LC1D1S5                       2852
#define LC1D1S6                       2853
#define CLC1SEL0_D1S6                 2854
#define LC1D1S7                       2855
#define CLC1SEL0_D1S7                 2856
#define CLC1SEL1                      2857
#define CLC1SEL1_D2S                  2858
#define CLC1SEL1_D2S0                 2859
#define LC1D2S0                       2860
#define LC1D2S                        2861
#define CLC1SEL1_D2S1                 2862
#define LC1D2S1                       2863
#define CLC1SEL1_D2S2                 2864
#define LC1D2S2                       2865
#define CLC1SEL1_D2S3                 2866
#define LC1D2S3                       2867
#define LC1D2S4                       2868
#define CLC1SEL1_D2S4                 2869
#define D2S5                          2870
#define LC1D2S5                       2871
#define LC1D2S6                       2872
#define CLC1SEL1_D2S6                 2873
#define CLC1SEL1_D2S7                 2874
#define LC1D2S7                       2875
#define CLC1SEL2                      2876
#define CLC1SEL2_D3S                  2877
#define LC1D3S0                       2878
#define LC1D3S                        2879
#define CLC1SEL2_D3S0                 2880
#define LC1D3S1                       2881
#define CLC1SEL2_D3S1                 2882
#define LC1D3S2                       2883
#define CLC1SEL2_D3S2                 2884
#define LC1D3S3                       2885
#define CLC1SEL2_D3S3                 2886
#define LC1D3S4                       2887
#define CLC1SEL2_D3S4                 2888
#define LC1D3S5                       2889
#define CLC1SEL2_D3S5                 2890
#define LC1D3S6                       2891
#define CLC1SEL2_D3S6                 2892
#define LC1D3S7                       2893
#define CLC1SEL2_D3S7                 2894
#define CLC1SEL3                      2895
#define LC1D4S                        2896
#define CLC1SEL3_D4S                  2897
#define LC1D4S0                       2898
#define CLC1SEL3_D4S0                 2899
#define LC1D4S1                       2900
#define CLC1SEL3_D4S1                 2901
#define LC1D4S2                       2902
#define CLC1SEL3_D4S2                 2903
#define LC1D4S3                       2904
#define CLC1SEL3_D4S3                 2905
#define LC1D4S4                       2906
#define CLC1SEL3_D4S4                 2907
#define LC1D4S5                       2908
#define CLC1SEL3_D4S5                 2909
#define LC1D4S6                       2910
#define CLC1SEL3_D4S6                 2911
#define LC1D4S7                       2912
#define CLC1SEL3_D4S7                 2913
#define CLC1GLS0                      2914
#define CLC1GLS0_D1N                  2915
#define LC1G1D1N                      2916
#define CLC1GLS0_D1T                  2917
#define LC1G1D1T                      2918
#define LC1G1D2N                      2919
#define CLC1GLS0_D2N                  2920
#define LC1G1D2T                      2921
#define CLC1GLS0_D2T                  2922
#define CLC1GLS0_D3N                  2923
#define LC1G1D3N                      2924
#define CLC1GLS0_D3T                  2925
#define LC1G1D3T                      2926
#define CLC1GLS0_D4N                  2927
#define LC1G1D4N                      2928
#define CLC1GLS0_D4T                  2929
#define LC1G1D4T                      2930
#define CLC1GLS1                      2931
#define CLC1GLS1_D1N                  2932
#define LC1G2D1N                      2933
#define LC1G2D1T                      2934
#define CLC1GLS1_D1T                  2935
#define CLC1GLS1_D2N                  2936
#define LC1G2D2N                      2937
#define LC1G2D2T                      2938
#define CLC1GLS1_D2T                  2939
#define CLC1GLS1_D3N                  2940
#define LC1G2D3N                      2941
#define LC1G2D3T                      2942
#define CLC1GLS1_D3T                  2943
#define CLC1GLS1_D4N                  2944
#define LC1G2D4N                      2945
#define LC1G2D4T                      2946
#define CLC1GLS1_D4T                  2947
#define CLC1GLS2                      2948
#define CLC1GLS2_D1N                  2949
#define LC1G3D1N                      2950
#define LC1G3D1T                      2951
#define CLC1GLS2_D1T                  2952
#define LC1G3D2N                      2953
#define CLC1GLS2_D2N                  2954
#define LC1G3D2T                      2955
#define CLC1GLS2_D2T                  2956
#define CLC1GLS2_D3N                  2957
#define LC1G3D3N                      2958
#define LC1G3D3T                      2959
#define CLC1GLS2_D3T                  2960
#define LC1G3D4N                      2961
#define CLC1GLS2_D4N                  2962
#define LC1G3D4T                      2963
#define CLC1GLS2_D4T                  2964
#define CLC1GLS3                      2965
#define LC1G4D1N                      2966
#define CLC1GLS3_G4D1N                2967
#define LC1G4D1T                      2968
#define CLC1GLS3_G4D1T                2969
#define CLC1GLS3_G4D2N                2970
#define LC1G4D2N                      2971
#define CLC1GLS3_G4D2T                2972
#define LC1G4D2T                      2973
#define LC1G4D3N                      2974
#define CLC1GLS3_G4D3N                2975
#define LC1G4D3T                      2976
#define CLC1GLS3_G4D3T                2977
#define CLC1GLS3_G4D4N                2978
#define LC1G4D4N                      2979
#define CLC1GLS3_G4D4T                2980
#define LC1G4D4T                      2981
#define CLC2CON                       2982
#define LC2MODE0                      2983
#define CLC2CON_MODE                  2984
#define LC2MODE                       2985
#define CLC2CON_MODE0                 2986
#define LC2MODE1                      2987
#define CLC2CON_MODE1                 2988
#define LC2MODE2                      2989
#define CLC2CON_MODE2                 2990
#define LC2INTN                       2991
#define CLC2CON_INTN                  2992
#define LC2INTP                       2993
#define CLC2CON_INTP                  2994
#define CLC2CON_OUT                   2995
#define LC2OUT                        2996
#define CLC2CON_EN                    2997
#define LC2EN                         2998
#define CLC2POL                       2999
#define LC2G1POL                      3000
#define CLC2POL_G1POL                 3001
#define LC2G2POL                      3002
#define CLC2POL_G2POL                 3003
#define LC2G3POL                      3004
#define CLC2POL_G3POL                 3005
#define LC2G4POL                      3006
#define CLC2POL_G4POL                 3007
#define CLC2POL_POL                   3008
#define LC2POL                        3009
#define CLC2SEL0                      3010
#define CLC2SEL0_D1S                  3011
#define LC2D1S                        3012
#define LC2D1S0                       3013
#define CLC2SEL0_D1S0                 3014
#define LC2D1S1                       3015
#define CLC2SEL0_D1S1                 3016
#define LC2D1S2                       3017
#define CLC2SEL0_D1S2                 3018
#define LC2D1S3                       3019
#define CLC2SEL0_D1S3                 3020
#define LC2D1S4                       3021
#define CLC2SEL0_D1S4                 3022
#define LC2D1S5                       3023
#define CLC2SEL0_D1S5                 3024
#define LC2D1S6                       3025
#define CLC2SEL0_D1S6                 3026
#define LC2D1S7                       3027
#define CLC2SEL0_D1S7                 3028
#define CLC2SEL1                      3029
#define LC2D2S0                       3030
#define LC2D2S                        3031
#define CLC2SEL1_D2S                  3032
#define CLC2SEL1_D2S0                 3033
#define LC2D2S1                       3034
#define CLC2SEL1_D2S1                 3035
#define LC2D2S2                       3036
#define CLC2SEL1_D2S2                 3037
#define LC2D2S3                       3038
#define CLC2SEL1_D2S3                 3039
#define LC2D2S4                       3040
#define CLC2SEL1_D2S4                 3041
#define LC2D2S5                       3042
#define CLC2SEL1_D2S5                 3043
#define LC2D2S6                       3044
#define CLC2SEL1_D2S6                 3045
#define LC2D2S7                       3046
#define CLC2SEL1_D2S7                 3047
#define CLC2SEL2                      3048
#define CLC2SEL2_D3S0                 3049
#define LC2D3S                        3050
#define CLC2SEL2_D3S                  3051
#define LC2D3S0                       3052
#define CLC2SEL2_D3S1                 3053
#define LC2D3S1                       3054
#define CLC2SEL2_D3S2                 3055
#define LC2D3S2                       3056
#define CLC2SEL2_D3S3                 3057
#define LC2D3S3                       3058
#define CLC2SEL2_D3S4                 3059
#define LC2D3S4                       3060
#define CLC2SEL2_D3S5                 3061
#define LC2D3S5                       3062
#define CLC2SEL2_D3S6                 3063
#define LC2D3S6                       3064
#define CLC2SEL2_D3S7                 3065
#define LC2D3S7                       3066
#define CLC2SEL3                      3067
#define LC2D4S                        3068
#define CLC2SEL3_D4S0                 3069
#define LC2D4S0                       3070
#define CLC2SEL3_D4S                  3071
#define CLC2SEL3_D4S1                 3072
#define LC2D4S1                       3073
#define CLC2SEL3_D4S2                 3074
#define LC2D4S2                       3075
#define CLC2SEL3_D4S3                 3076
#define LC2D4S3                       3077
#define CLC2SEL3_D4S4                 3078
#define LC2D4S4                       3079
#define CLC2SEL3_D4S5                 3080
#define LC2D4S5                       3081
#define CLC2SEL3_D4S6                 3082
#define LC2D4S6                       3083
#define CLC2SEL3_D4S7                 3084
#define LC2D4S7                       3085
#define CLC2GLS0                      3086
#define LC2G1D1N                      3087
#define CLC2GLS0_D1N                  3088
#define CLC2GLS0_D1T                  3089
#define LC2G1D1T                      3090
#define LC2G1D2N                      3091
#define CLC2GLS0_D2N                  3092
#define CLC2GLS0_D2T                  3093
#define LC2G1D2T                      3094
#define LC2G1D3N                      3095
#define CLC2GLS0_D3N                  3096
#define CLC2GLS0_D3T                  3097
#define LC2G1D3T                      3098
#define LC2G1D4N                      3099
#define CLC2GLS0_D4N                  3100
#define CLC2GLS0_D4T                  3101
#define LC2G1D4T                      3102
#define CLC2GLS1                      3103
#define CLC2GLS1_D1N                  3104
#define LC2G2D1N                      3105
#define CLC2GLS1_D1T                  3106
#define LC2G2D1T                      3107
#define CLC2GLS1_D2N                  3108
#define LC2G2D2N                      3109
#define CLC2GLS1_D2T                  3110
#define LC2G2D2T                      3111
#define LC2G2D3N                      3112
#define CLC2GLS1_D3N                  3113
#define LC2G2D3T                      3114
#define CLC2GLS1_D3T                  3115
#define LC2G2D4N                      3116
#define CLC2GLS1_D4N                  3117
#define LC2G2D4T                      3118
#define CLC2GLS1_D4T                  3119
#define CLC2GLS2                      3120
#define LC2G3D1N                      3121
#define CLC2GLS2_D1N                  3122
#define CLC2GLS2_D1T                  3123
#define LC2G3D1T                      3124
#define CLC2GLS2_D2N                  3125
#define LC2G3D2N                      3126
#define LC2G3D2T                      3127
#define CLC2GLS2_D2T                  3128
#define CLC2GLS2_D3N                  3129
#define LC2G3D3N                      3130
#define CLC2GLS2_D3T                  3131
#define LC2G3D3T                      3132
#define CLC2GLS2_D4N                  3133
#define LC2G3D4N                      3134
#define LC2G3D4T                      3135
#define CLC2GLS2_D4T                  3136
#define CLC2GLS3                      3137
#define LC2G4D1N                      3138
#define CLC2GLS3_G4D1N                3139
#define CLC2GLS3_G4D1T                3140
#define LC2G4D1T                      3141
#define CLC2GLS3_G4D2N                3142
#define LC2G4D2N                      3143
#define LC2G4D2T                      3144
#define CLC2GLS3_G4D2T                3145
#define CLC2GLS3_G4D3N                3146
#define LC2G4D3N                      3147
#define CLC2GLS3_G4D3T                3148
#define LC2G4D3T                      3149
#define LC2G4D4N                      3150
#define CLC2GLS3_G4D4N                3151
#define CLC2GLS3_G4D4T                3152
#define LC2G4D4T                      3153
#define CLC3CON                       3154
#define LC3MODE                       3155
#define CLC3CON_MODE0                 3156
#define LC3MODE0                      3157
#define CLC3CON_MODE                  3158
#define CLC3CON_MODE1                 3159
#define LC3MODE1                      3160
#define CLC3CON_MODE2                 3161
#define LC3MODE2                      3162
#define LC3INTN                       3163
#define CLC3CON_INTN                  3164
#define LC3INTP                       3165
#define CLC3CON_INTP                  3166
#define LC3OUT                        3167
#define CLC3CON_OUT                   3168
#define LC3EN                         3169
#define CLC3CON_EN                    3170
#define CLC3POL                       3171
#define LC3G1POL                      3172
#define CLC3POL_G1POL                 3173
#define LC3G2POL                      3174
#define CLC3POL_G2POL                 3175
#define CLC3POL_G3POL                 3176
#define LC3G3POL                      3177
#define LC3G4POL                      3178
#define CLC3POL_G4POL                 3179
#define LC3POL                        3180
#define CLC3POL_POL                   3181
#define CLC3SEL0                      3182
#define LC3D1S                        3183
#define CLC3SEL0_D1S                  3184
#define LC3D1S0                       3185
#define CLC3SEL0_D1S0                 3186
#define LC3D1S1                       3187
#define CLC3SEL0_D1S1                 3188
#define LC3D1S2                       3189
#define CLC3SEL0_D1S2                 3190
#define LC3D1S3                       3191
#define CLC3SEL0_D1S3                 3192
#define LC3D1S4                       3193
#define CLC3SEL0_D1S4                 3194
#define LC3D1S5                       3195
#define CLC3SEL0_D1S5                 3196
#define LC3D1S6                       3197
#define CLC3SEL0_D1S6                 3198
#define LC3D1S7                       3199
#define CLC3SEL0_D1S7                 3200
#define CLC3SEL1                      3201
#define LC3D2S0                       3202
#define LC3D2S                        3203
#define CLC3SEL1_D2S0                 3204
#define CLC3SEL1_D2S                  3205
#define LC3D2S1                       3206
#define CLC3SEL1_D2S1                 3207
#define LC3D2S2                       3208
#define CLC3SEL1_D2S2                 3209
#define LC3D2S3                       3210
#define CLC3SEL1_D2S3                 3211
#define LC3D2S4                       3212
#define CLC3SEL1_D2S4                 3213
#define LC3D2S5                       3214
#define CLC3SEL1_D2S5                 3215
#define LC3D2S6                       3216
#define CLC3SEL1_D2S6                 3217
#define LC3D2S7                       3218
#define CLC3SEL1_D2S7                 3219
#define CLC3SEL2                      3220
#define LC3D3S                        3221
#define CLC3SEL2_D3S                  3222
#define LC3D3S0                       3223
#define CLC3SEL2_D3S0                 3224
#define LC3D3S1                       3225
#define CLC3SEL2_D3S1                 3226
#define LC3D3S2                       3227
#define CLC3SEL2_D3S2                 3228
#define LC3D3S3                       3229
#define CLC3SEL2_D3S3                 3230
#define LC3D3S4                       3231
#define CLC3SEL2_D3S4                 3232
#define LC3D3S5                       3233
#define CLC3SEL2_D3S5                 3234
#define LC3D3S6                       3235
#define CLC3SEL2_D3S6                 3236
#define LC3D3S7                       3237
#define CLC3SEL2_D3S7                 3238
#define CLC3SEL3                      3239
#define CLC3SEL3_D4S                  3240
#define LC3D4S0                       3241
#define LC3D4S                        3242
#define CLC3SEL3_D4S0                 3243
#define LC3D4S1                       3244
#define CLC3SEL3_D4S1                 3245
#define LC3D4S2                       3246
#define CLC3SEL3_D4S2                 3247
#define LC3D4S3                       3248
#define CLC3SEL3_D4S3                 3249
#define LC3D4S4                       3250
#define CLC3SEL3_D4S4                 3251
#define LC3D4S5                       3252
#define CLC3SEL3_D4S5                 3253
#define LC3D4S6                       3254
#define CLC3SEL3_D4S6                 3255
#define LC3D4S7                       3256
#define CLC3SEL3_D4S7                 3257
#define CLC3GLS0                      3258
#define CLC3GLS0_D1N                  3259
#define LC3G1D1N                      3260
#define LC3G1D1T                      3261
#define CLC3GLS0_D1T                  3262
#define LC3G1D2N                      3263
#define CLC3GLS0_D2N                  3264
#define CLC3GLS0_D2T                  3265
#define LC3G1D2T                      3266
#define CLC3GLS0_D3N                  3267
#define LC3G1D3N                      3268
#define LC3G1D3T                      3269
#define CLC3GLS0_D3T                  3270
#define CLC3GLS0_D4N                  3271
#define LC3G1D4N                      3272
#define CLC3GLS0_D4T                  3273
#define LC3G1D4T                      3274
#define CLC3GLS1                      3275
#define LC3G2D1N                      3276
#define CLC3GLS1_D1N                  3277
#define CLC3GLS1_D1T                  3278
#define LC3G2D1T                      3279
#define LC3G2D2N                      3280
#define CLC3GLS1_D2N                  3281
#define LC3G2D2T                      3282
#define CLC3GLS1_D2T                  3283
#define LC3G2D3N                      3284
#define CLC3GLS1_D3N                  3285
#define CLC3GLS1_D3T                  3286
#define LC3G2D3T                      3287
#define LC3G2D4N                      3288
#define CLC3GLS1_D4N                  3289
#define LC3G2D4T                      3290
#define CLC3GLS1_D4T                  3291
#define CLC3GLS2                      3292
#define LC3G3D1N                      3293
#define CLC3GLS2_D1N                  3294
#define LC3G3D1T                      3295
#define CLC3GLS2_D1T                  3296
#define CLC3GLS2_D2N                  3297
#define LC3G3D2N                      3298
#define CLC3GLS2_D2T                  3299
#define LC3G3D2T                      3300
#define CLC3GLS2_D3N                  3301
#define LC3G3D3N                      3302
#define LC3G3D3T                      3303
#define CLC3GLS2_D3T                  3304
#define CLC3GLS2_D4N                  3305
#define LC3G3D4N                      3306
#define CLC3GLS2_D4T                  3307
#define LC3G3D4T                      3308
#define CLC3GLS3                      3309
#define LC3G4D1N                      3310
#define CLC3GLS3_G4D1N                3311
#define LC3G4D1T                      3312
#define CLC3GLS3_G4D1T                3313
#define LC3G4D2N                      3314
#define CLC3GLS3_G4D2N                3315
#define CLC3GLS3_G4D2T                3316
#define LC3G4D2T                      3317
#define LC3G4D3N                      3318
#define CLC3GLS3_G4D3N                3319
#define CLC3GLS3_G4D3T                3320
#define LC3G4D3T                      3321
#define LC3G4D4N                      3322
