tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18877_tdd.h
#define CLC3GLS3_G4D4N                3323
#define LC3G4D4T                      3324
#define CLC3GLS3_G4D4T                3325
#define CLC4CON                       3326
#define LC4MODE                       3327
#define CLC4CON_MODE                  3328
#define LC4MODE0                      3329
#define CLC4CON_MODE0                 3330
#define LC4MODE1                      3331
#define CLC4CON_MODE1                 3332
#define LC4MODE2                      3333
#define CLC4CON_MODE2                 3334
#define LC4INTN                       3335
#define CLC4CON_INTN                  3336
#define CLC4CON_INTP                  3337
#define LC4INTP                       3338
#define CLC4CON_OUT                   3339
#define LC4OUT                        3340
#define CLC4CON_EN                    3341
#define LC4EN                         3342
#define CLC4POL                       3343
#define CLC4POL_G1POL                 3344
#define LC4G1POL                      3345
#define CLC4POL_G2POL                 3346
#define LC4G2POL                      3347
#define CLC4POL_G3POL                 3348
#define LC4G3POL                      3349
#define LC4G4POL                      3350
#define CLC4POL_G4POL                 3351
#define LC4POL                        3352
#define CLC4POL_POL                   3353
#define CLC4SEL0                      3354
#define LC4D1S0                       3355
#define CLC4SEL0_D1S                  3356
#define CLC4SEL0_D1S0                 3357
#define LC4D1S                        3358
#define LC4D1S1                       3359
#define CLC4SEL0_D1S1                 3360
#define LC4D1S2                       3361
#define CLC4SEL0_D1S2                 3362
#define LC4D1S3                       3363
#define CLC4SEL0_D1S3                 3364
#define LC4D1S4                       3365
#define CLC4SEL0_D1S4                 3366
#define LC4D1S5                       3367
#define CLC4SEL0_D1S5                 3368
#define LC4D1S6                       3369
#define CLC4SEL0_D1S6                 3370
#define LC4D1S7                       3371
#define CLC4SEL0_D1S7                 3372
#define CLC4SEL1                      3373
#define CLC4SEL1_D2S                  3374
#define CLC4SEL1_D2S0                 3375
#define LC4D2S                        3376
#define LC4D2S0                       3377
#define CLC4SEL1_D2S1                 3378
#define LC4D2S1                       3379
#define CLC4SEL1_D2S2                 3380
#define LC4D2S2                       3381
#define CLC4SEL1_D2S3                 3382
#define LC4D2S3                       3383
#define CLC4SEL1_D2S4                 3384
#define LC4D2S4                       3385
#define CLC4SEL1_D2S5                 3386
#define LC4D2S5                       3387
#define CLC4SEL1_D2S6                 3388
#define LC4D2S6                       3389
#define CLC4SEL1_D2S7                 3390
#define LC4D2S7                       3391
#define CLC4SEL2                      3392
#define CLC4SEL2_D3S                  3393
#define LC4D3S0                       3394
#define LC4D3S                        3395
#define CLC4SEL2_D3S0                 3396
#define LC4D3S1                       3397
#define CLC4SEL2_D3S1                 3398
#define LC4D3S2                       3399
#define CLC4SEL2_D3S2                 3400
#define LC4D3S3                       3401
#define CLC4SEL2_D3S3                 3402
#define LC4D3S4                       3403
#define CLC4SEL2_D3S4                 3404
#define LC4D3S5                       3405
#define CLC4SEL2_D3S5                 3406
#define LC4D3S6                       3407
#define CLC4SEL2_D3S6                 3408
#define LC4D3S7                       3409
#define CLC4SEL2_D3S7                 3410
#define CLC4SEL3                      3411
#define CLC4SEL3_D4S                  3412
#define LC4D4S0                       3413
#define CLC4SEL3_D4S0                 3414
#define LC4D4S                        3415
#define LC4D4S1                       3416
#define CLC4SEL3_D4S1                 3417
#define LC4D4S2                       3418
#define CLC4SEL3_D4S2                 3419
#define LC4D4S3                       3420
#define CLC4SEL3_D4S3                 3421
#define LC4D4S4                       3422
#define CLC4SEL3_D4S4                 3423
#define LC4D4S5                       3424
#define CLC4SEL3_D4S5                 3425
#define LC4D4S6                       3426
#define CLC4SEL3_D4S6                 3427
#define LC4D4S7                       3428
#define CLC4SEL3_D4S7                 3429
#define CLC4GLS0                      3430
#define CLC4GLS0_D1N                  3431
#define LC4G1D1N                      3432
#define CLC4GLS0_D1T                  3433
#define LC4G1D1T                      3434
#define CLC4GLS0_D2N                  3435
#define LC4G1D2N                      3436
#define CLC4GLS0_D2T                  3437
#define LC4G1D2T                      3438
#define CLC4GLS0_D3N                  3439
#define LC4G1D3N                      3440
#define CLC4GLS0_D3T                  3441
#define LC4G1D3T                      3442
#define CLC4GLS0_D4N                  3443
#define LC4G1D4N                      3444
#define CLC4GLS0_D4T                  3445
#define LC4G1D4T                      3446
#define CLC4GLS1                      3447
#define CLC4GLS1_D1N                  3448
#define LC4G2D1N                      3449
#define CLC4GLS1_D1T                  3450
#define LC4G2D1T                      3451
#define LC4G2D2N                      3452
#define CLC4GLS1_D2N                  3453
#define LC4G2D2T                      3454
#define CLC4GLS1_D2T                  3455
#define CLC4GLS1_D3N                  3456
#define LC4G2D3N                      3457
#define LC4G2D3T                      3458
#define CLC4GLS1_D3T                  3459
#define CLC4GLS1_D4N                  3460
#define LC4G2D4N                      3461
#define CLC4GLS1_D4T                  3462
#define LC4G2D4T                      3463
#define CLC4GLS2                      3464
#define CLC4GLS2_D1N                  3465
#define LC4G3D1N                      3466
#define CLC4GLS2_D1T                  3467
#define LC4G3D1T                      3468
#define LC4G3D2N                      3469
#define CLC4GLS2_D2N                  3470
#define LC4G3D2T                      3471
#define CLC4GLS2_D2T                  3472
#define CLC4GLS2_D3N                  3473
#define LC4G3D3N                      3474
#define CLC4GLS2_D3T                  3475
#define LC4G3D3T                      3476
#define LC4G3D4N                      3477
#define CLC4GLS2_D4N                  3478
#define LC4G3D4T                      3479
#define CLC4GLS2_D4T                  3480
#define CLC4GLS3                      3481
#define CLC4GLS3_G4D1N                3482
#define LC4G4D1N                      3483
#define LC4G4D1T                      3484
#define CLC4GLS3_G4D1T                3485
#define LC4G4D2N                      3486
#define CLC4GLS3_G4D2N                3487
#define LC4G4D2T                      3488
#define CLC4GLS3_G4D2T                3489
#define CLC4GLS3_G4D3N                3490
#define LC4G4D3N                      3491
#define CLC4GLS3_G4D3T                3492
#define LC4G4D3T                      3493
#define LC4G4D4N                      3494
#define CLC4GLS3_G4D4N                3495
#define LC4G4D4T                      3496
#define CLC4GLS3_G4D4T                3497
#define PPSLOCK                       3498
#define PPSLOCKED                     3499
#define INTPPS0                       3500
#define INTPPS                        3501
#define INTPPS1                       3502
#define INTPPS2                       3503
#define INTPPS3                       3504
#define T0CKIPPS                      3505
#define T0CKIPPS0                     3506
#define T0CKIPPS1                     3507
#define T0CKIPPS2                     3508
#define T0CKIPPS3                     3509
#define T1CKIPPS0                     3510
#define T1CKIPPS                      3511
#define T1CKIPPS1                     3512
#define T1CKIPPS2                     3513
#define T1CKIPPS3                     3514
#define T1CKIPPS4                     3515
#define T1GPPS0                       3516
#define T1GPPS                        3517
#define T1GPPS1                       3518
#define T1GPPS2                       3519
#define T1GPPS3                       3520
#define T1GPPS4                       3521
#define T3CKIPPS0                     3522
#define T3CKIPPS                      3523
#define T3CKIPPS1                     3524
#define T3CKIPPS2                     3525
#define T3CKIPPS3                     3526
#define T3CKIPPS4                     3527
#define T3GPPS0                       3528
#define T3GPPS                        3529
#define T3GPPS1                       3530
#define T3GPPS2                       3531
#define T3GPPS3                       3532
#define T3GPPS4                       3533
#define T5CKIPPS0                     3534
#define T5CKIPPS                      3535
#define T5CKIPPS1                     3536
#define T5CKIPPS2                     3537
#define T5CKIPPS3                     3538
#define T5CKIPPS4                     3539
#define T5GPPS                        3540
#define T5GPPS0                       3541
#define T5GPPS1                       3542
#define T5GPPS2                       3543
#define T5GPPS3                       3544
#define T5GPPS4                       3545
#define T2AINPPS                      3546
#define T2AINPPS0                     3547
#define T2AINPPS1                     3548
#define T2AINPPS2                     3549
#define T2AINPPS3                     3550
#define T2AINPPS4                     3551
#define T4AINPPS                      3552
#define T4AINPPS0                     3553
#define T4AINPPS1                     3554
#define T4AINPPS2                     3555
#define T4AINPPS3                     3556
#define T4AINPPS4                     3557
#define T6AINPPS0                     3558
#define T6AINPPS                      3559
#define T6AINPPS1                     3560
#define T6AINPPS2                     3561
#define T6AINPPS3                     3562
#define T6AINPPS4                     3563
#define CCP1PPS0                      3564
#define CCP1PPS                       3565
#define CCP1PPS1                      3566
#define CCP1PPS2                      3567
#define CCP1PPS3                      3568
#define CCP1PPS4                      3569
#define CCP2PPS0                      3570
#define CCP2PPS                       3571
#define CCP2PPS1                      3572
#define CCP2PPS2                      3573
#define CCP2PPS3                      3574
#define CCP2PPS4                      3575
#define CCP3PPS0                      3576
#define CCP3PPS                       3577
#define CCP3PPS1                      3578
#define CCP3PPS2                      3579
#define CCP3PPS3                      3580
#define CCP3PPS4                      3581
#define CCP4PPS0                      3582
#define CCP4PPS                       3583
#define CCP4PPS1                      3584
#define CCP4PPS2                      3585
#define CCP4PPS3                      3586
#define CCP4PPS4                      3587
#define CCP5PPS                       3588
#define CCP5PPS0                      3589
#define CCP5PPS1                      3590
#define CCP5PPS2                      3591
#define CCP5PPS3                      3592
#define CCP5PPS4                      3593
#define CCP6PPS                       3594
#define SMT1WINPPS                    3595
#define SMU1WINPPS0                   3596
#define SMU1WINPPS1                   3597
#define SMU1WINPPS2                   3598
#define SMU1WINPPS3                   3599
#define SMU1WINPPS4                   3600
#define SMT1SIGPPS                    3601
#define SMU1SIGPPS0                   3602
#define SMU1SIGPPS1                   3603
#define SMU1SIGPPS2                   3604
#define SMU1SIGPPS3                   3605
#define SMU1SIGPPS4                   3606
#define SMT2WINPPS                    3607
#define SMU2WINPPS0                   3608
#define SMU2WINPPS1                   3609
#define SMU2WINPPS2                   3610
#define SMU2WINPPS3                   3611
#define SMU2WINPPS4                   3612
#define SMT2SIGPPS                    3613
#define SMU2SIGPPS0                   3614
#define SMU2SIGPPS1                   3615
#define SMU2SIGPPS2                   3616
#define SMU2SIGPPS3                   3617
#define SMU2SIGPPS4                   3618
#define CWG1PPS0                      3619
#define CWG1PPS                       3620
#define CWG1PPS1                      3621
#define CWG1PPS2                      3622
#define CWG1PPS3                      3623
#define CWG1PPS4                      3624
#define CWG2PPS0                      3625
#define CWG2PPS                       3626
#define CWG2PPS1                      3627
#define CWG2PPS2                      3628
#define CWG2PPS3                      3629
#define CWG2PPS4                      3630
#define CWG3PPS0                      3631
#define CWG3PPS                       3632
#define CWG3PPS1                      3633
#define CWG3PPS2                      3634
#define CWG3PPS3                      3635
#define CWG3PPS4                      3636
#define MDCARLPPS                     3637
#define MDCARLPPS0                    3638
#define MDCARLPPS1                    3639
#define MDCARLPPS2                    3640
#define MDCARLPPS3                    3641
#define MDCARLPPS4                    3642
#define MDCARHPPS0                    3643
#define MDCARHPPS                     3644
#define MDCARHPPS1                    3645
#define MDCARHPPS2                    3646
#define MDCARHPPS3                    3647
#define MDCARHPPS4                    3648
#define MDSRCPPS0                     3649
#define MDSRCPPS                      3650
#define MDSRCPPS1                     3651
#define MDSRCPPS2                     3652
#define MDSRCPPS3                     3653
#define MDSRCPPS4                     3654
#define CLCIN0PPS                     3655
#define CLCIN0PPS0                    3656
#define CLCIN0PPS1                    3657
#define CLCIN0PPS2                    3658
#define CLCIN0PPS3                    3659
#define CLCIN0PPS4                    3660
#define CLCIN1PPS                     3661
#define CLCIN1PPS0                    3662
#define CLCIN1PPS1                    3663
#define CLCIN1PPS2                    3664
#define CLCIN1PPS3                    3665
#define CLCIN1PPS4                    3666
#define CLCIN2PPS                     3667
#define CLCIN2PPS0                    3668
#define CLCIN2PPS1                    3669
#define CLCIN2PPS2                    3670
#define CLCIN2PPS3                    3671
#define CLCIN2PPS4                    3672
#define CLCIN3PPS                     3673
#define CLCIN3PPS0                    3674
#define CLCIN3PPS1                    3675
#define CLCIN3PPS2                    3676
#define CLCIN3PPS3                    3677
#define CLCIN3PPS4                    3678
#define ADCACTPPS                     3679
#define ADCACTPPS0                    3680
#define ADCACTPPS1                    3681
#define ADCACTPPS2                    3682
#define ADCACTPPS3                    3683
#define ADCACTPPS4                    3684
#define SSP1CLKPPS                    3685
#define SSP1CLKPPS0                   3686
#define SSP1CLKPPS1                   3687
#define SSP1CLKPPS2                   3688
#define SSP1CLKPPS3                   3689
#define SSP1CLKPPS4                   3690
#define SSP1DATPPS                    3691
#define SSP1DATPPS0                   3692
#define SSP1DATPPS1                   3693
#define SSP1DATPPS2                   3694
#define SSP1DATPPS3                   3695
#define SSP1DATPPS4                   3696
#define SSP1SSPPS                     3697
#define SSP1SSPPS0                    3698
#define SSP1SSPPS1                    3699
#define SSP1SSPPS2                    3700
#define SSP1SSPPS3                    3701
#define SSP1SSPPS4                    3702
#define SSP2CLKPPS                    3703
#define SSP2CLKPPS0                   3704
#define SSP2CLKPPS1                   3705
#define SSP2CLKPPS2                   3706
#define SSP2CLKPPS3                   3707
#define SSP2CLKPPS4                   3708
#define SSP2DATPPS                    3709
#define SSP2DATPPS0                   3710
#define SSP2DATPPS1                   3711
#define SSP2DATPPS2                   3712
#define SSP2DATPPS3                   3713
#define SSP2DATPPS4                   3714
#define SSP2SSPPS                     3715
#define SSP2SSPPS0                    3716
#define SSP2SSPPS1                    3717
#define SSP2SSPPS2                    3718
#define SSP2SSPPS3                    3719
#define SSP2SSPPS4                    3720
#define RXPPS                         3721
#define RXPPS0                        3722
#define RXPPS1                        3723
#define RXPPS2                        3724
#define RXPPS3                        3725
#define RXPPS4                        3726
#define TXPPS                         3727
#define TXPPS0                        3728
#define TXPPS1                        3729
#define TXPPS2                        3730
#define TXPPS3                        3731
#define TXPPS4                        3732
#define RA0PPS                        3733
#define RA0PPS0                       3734
#define RA0PPS1                       3735
#define RA0PPS2                       3736
#define RA0PPS3                       3737
#define RA0PPS4                       3738
#define RA0PPS5                       3739
#define RA1PPS                        3740
#define RA1PPS0                       3741
#define RA1PPS1                       3742
#define RA1PPS2                       3743
#define RA1PPS3                       3744
#define RA1PPS4                       3745
#define RA1PPS5                       3746
#define RA2PPS                        3747
#define RA2PPS0                       3748
#define RA2PPS1                       3749
#define RA2PPS2                       3750
#define RA2PPS3                       3751
#define RA2PPS4                       3752
#define RA2PPS5                       3753
#define RA3PPS                        3754
#define RA3PPS0                       3755
#define RA3PPS1                       3756
#define RA3PPS2                       3757
#define RA3PPS3                       3758
#define RA3PPS4                       3759
#define RA3PPS5                       3760
#define RA4PPS                        3761
#define RA4PPS0                       3762
#define RA4PPS1                       3763
#define RA4PPS2                       3764
#define RA4PPS3                       3765
#define RA4PPS4                       3766
#define RA4PPS5                       3767
#define RA5PPS                        3768
#define RA5PPS0                       3769
#define RA5PPS1                       3770
#define RA5PPS2                       3771
#define RA5PPS3                       3772
#define RA5PPS4                       3773
#define RA5PPS5                       3774
#define RA6PPS                        3775
#define RA6PPS0                       3776
#define RA6PPS1                       3777
#define RA6PPS2                       3778
#define RA6PPS3                       3779
#define RA6PPS4                       3780
#define RA6PPS5                       3781
#define RA7PPS                        3782
#define RA7PPS0                       3783
#define RA7PPS1                       3784
#define RA7PPS2                       3785
#define RA7PPS3                       3786
#define RA7PPS4                       3787
#define RA7PPS5                       3788
#define RB0PPS                        3789
#define RB0PPS0                       3790
#define RB0PPS1                       3791
#define RB0PPS2                       3792
#define RB0PPS3                       3793
#define RB0PPS4                       3794
#define RB0PPS5                       3795
#define RB1PPS                        3796
#define RB1PPS0                       3797
#define RB1PPS1                       3798
#define RB1PPS2                       3799
#define RB1PPS3                       3800
#define RB1PPS4                       3801
#define RB1PPS5                       3802
#define RB2PPS                        3803
#define RB2PPS0                       3804
#define RB2PPS1                       3805
#define RB2PPS2                       3806
#define RB2PPS3                       3807
#define RB2PPS4                       3808
#define RB2PPS5                       3809
#define RB3PPS                        3810
#define RB3PPS0                       3811
#define RB3PPS1                       3812
#define RB3PPS2                       3813
#define RB3PPS3                       3814
#define RB3PPS4                       3815
#define RB3PPS5                       3816
#define RB4PPS                        3817
#define RB4PPS0                       3818
#define RB4PPS1                       3819
#define RB4PPS2                       3820
#define RB4PPS3                       3821
#define RB4PPS4                       3822
#define RB4PPS5                       3823
#define RB5PPS                        3824
#define RB5PPS0                       3825
#define RB5PPS1                       3826
#define RB5PPS2                       3827
#define RB5PPS3                       3828
#define RB5PPS4                       3829
#define RB5PPS5                       3830
#define RB6PPS                        3831
#define RB6PPS0                       3832
#define RB6PPS1                       3833
#define RB6PPS2                       3834
#define RB6PPS3                       3835
#define RB6PPS4                       3836
#define RB6PPS5                       3837
#define RB7PPS                        3838
#define RB7PPS0                       3839
#define RB7PPS1                       3840
#define RB7PPS2                       3841
#define RB7PPS3                       3842
#define RB7PPS4                       3843
#define RB7PPS5                       3844
#define RC0PPS                        3845
#define RC0PPS0                       3846
#define RC0PPS1                       3847
#define RC0PPS2                       3848
#define RC0PPS3                       3849
#define RC0PPS4                       3850
#define RC0PPS5                       3851
#define RC1PPS                        3852
#define RC1PPS0                       3853
#define RC1PPS1                       3854
#define RC1PPS2                       3855
#define RC1PPS3                       3856
#define RC1PPS4                       3857
#define RC1PPS5                       3858
#define RC2PPS                        3859
#define RC2PPS0                       3860
#define RC2PPS1                       3861
#define RC2PPS2                       3862
#define RC2PPS3                       3863
#define RC2PPS4                       3864
#define RC2PPS5                       3865
#define RC3PPS                        3866
#define RC3PPS0                       3867
#define RC3PPS1                       3868
#define RC3PPS2                       3869
#define RC3PPS3                       3870
#define RC3PPS4                       3871
#define RC3PPS5                       3872
#define RC4PPS                        3873
#define RC4PPS0                       3874
#define RC4PPS1                       3875
#define RC4PPS2                       3876
#define RC4PPS3                       3877
#define RC4PPS4                       3878
#define RC4PPS5                       3879
#define RC5PPS                        3880
