tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf18877_tdd.h
#define RC5PPS0                       3881
#define RC5PPS1                       3882
#define RC5PPS2                       3883
#define RC5PPS3                       3884
#define RC5PPS4                       3885
#define RC5PPS5                       3886
#define RC6PPS                        3887
#define RC6PPS0                       3888
#define RC6PPS1                       3889
#define RC6PPS2                       3890
#define RC6PPS3                       3891
#define RC6PPS4                       3892
#define RC6PPS5                       3893
#define RC7PPS                        3894
#define RC7PPS0                       3895
#define RC7PPS1                       3896
#define RC7PPS2                       3897
#define RC7PPS3                       3898
#define RC7PPS4                       3899
#define RC7PPS5                       3900
#define RD0PPS                        3901
#define RD0PPS0                       3902
#define RD0PPS1                       3903
#define RD0PPS2                       3904
#define RD0PPS3                       3905
#define RD0PPS4                       3906
#define RD0PPS5                       3907
#define RD1PPS                        3908
#define RD1PPS0                       3909
#define RD1PPS1                       3910
#define RD1PPS2                       3911
#define RD1PPS3                       3912
#define RD1PPS4                       3913
#define RD1PPS5                       3914
#define RD2PPS                        3915
#define RD2PPS0                       3916
#define RD2PPS1                       3917
#define RD2PPS2                       3918
#define RD2PPS3                       3919
#define RD2PPS4                       3920
#define RD2PPS5                       3921
#define RD3PPS                        3922
#define RD3PPS0                       3923
#define RD3PPS1                       3924
#define RD3PPS2                       3925
#define RD3PPS3                       3926
#define RD3PPS4                       3927
#define RD3PPS5                       3928
#define RD4PPS                        3929
#define RD4PPS0                       3930
#define RD4PPS1                       3931
#define RD4PPS2                       3932
#define RD4PPS3                       3933
#define RD4PPS4                       3934
#define RD4PPS5                       3935
#define RD5PPS                        3936
#define RD5PPS0                       3937
#define RD5PPS1                       3938
#define RD5PPS2                       3939
#define RD5PPS3                       3940
#define RD5PPS4                       3941
#define RD5PPS5                       3942
#define RD6PPS                        3943
#define RD6PPS0                       3944
#define RD6PPS1                       3945
#define RD6PPS2                       3946
#define RD6PPS3                       3947
#define RD6PPS4                       3948
#define RD6PPS5                       3949
#define RD7PPS                        3950
#define RD7PPS0                       3951
#define RD7PPS1                       3952
#define RD7PPS2                       3953
#define RD7PPS3                       3954
#define RD7PPS4                       3955
#define RD7PPS5                       3956
#define RE0PPS                        3957
#define RE0PPS0                       3958
#define RE0PPS1                       3959
#define RE0PPS2                       3960
#define RE0PPS3                       3961
#define RE0PPS4                       3962
#define RE0PPS5                       3963
#define RE1PPS                        3964
#define RE1PPS0                       3965
#define RE1PPS1                       3966
#define RE1PPS2                       3967
#define RE1PPS3                       3968
#define RE1PPS4                       3969
#define RE1PPS5                       3970
#define RE2PPS                        3971
#define RE2PPS0                       3972
#define RE2PPS1                       3973
#define RE2PPS2                       3974
#define RE2PPS3                       3975
#define RE2PPS4                       3976
#define RE2PPS5                       3977
#define ANSELA                        3978
#define ANSA0                         3979
#define ANSA1                         3980
#define ANSA2                         3981
#define ANSA3                         3982
#define ANSA4                         3983
#define ANSA5                         3984
#define ANSA6                         3985
#define ANSA7                         3986
#define WPUA                          3987
#define WPUA0                         3988
#define WPUA1                         3989
#define WPUA2                         3990
#define WPUA3                         3991
#define WPUA4                         3992
#define WPUA5                         3993
#define WPUA6                         3994
#define WPUA7                         3995
#define ODCONA                        3996
#define ODCA0                         3997
#define ODCA1                         3998
#define ODCA2                         3999
#define ODCA3                         4000
#define ODCA4                         4001
#define ODCA5                         4002
#define ODCA6                         4003
#define ODCA7                         4004
#define SLRCONA                       4005
#define SLRA0                         4006
#define SLRA1                         4007
#define SLRA2                         4008
#define SLRA3                         4009
#define SLRA4                         4010
#define SLRA5                         4011
#define SLRA6                         4012
#define SLRA7                         4013
#define INLVLA                        4014
#define INLVLA0                       4015
#define INLVLA1                       4016
#define INLVLA2                       4017
#define INLVLA3                       4018
#define INLVLA4                       4019
#define INLVLA5                       4020
#define INLVLA6                       4021
#define INLVLA7                       4022
#define IOCAP                         4023
#define IOCAP0                        4024
#define IOCAP1                        4025
#define IOCAP2                        4026
#define IOCAP3                        4027
#define IOCAP4                        4028
#define IOCAP5                        4029
#define IOCAP6                        4030
#define IOCAP7                        4031
#define IOCAN                         4032
#define IOCAN0                        4033
#define IOCAN1                        4034
#define IOCAN2                        4035
#define IOCAN3                        4036
#define IOCAN4                        4037
#define IOCAN5                        4038
#define IOCAN6                        4039
#define IOCAN7                        4040
#define IOCAF                         4041
#define IOCAF0                        4042
#define IOCAF1                        4043
#define IOCAF2                        4044
#define IOCAF3                        4045
#define IOCAF4                        4046
#define IOCAF5                        4047
#define IOCAF6                        4048
#define IOCAF7                        4049
#define CCDNA                         4050
#define CCDNA0                        4051
#define CCDNA1                        4052
#define CCDNA2                        4053
#define CCDNA3                        4054
#define CCDNA4                        4055
#define CCDNA5                        4056
#define CCDNA6                        4057
#define CCDNA7                        4058
#define CCDPA                         4059
#define CCDPA0                        4060
#define CCDPA1                        4061
#define CCDPA2                        4062
#define CCDPA3                        4063
#define CCDPA4                        4064
#define CCDPA5                        4065
#define CCDPA6                        4066
#define CCDPA7                        4067
#define ANSELB                        4068
#define ANSB0                         4069
#define ANSB1                         4070
#define ANSB2                         4071
#define ANSB3                         4072
#define ANSB4                         4073
#define ANSB5                         4074
#define ANSB6                         4075
#define ANSB7                         4076
#define WPUB                          4077
#define WPUB0                         4078
#define WPUB1                         4079
#define WPUB2                         4080
#define WPUB3                         4081
#define WPUB4                         4082
#define WPUB5                         4083
#define WPUB6                         4084
#define WPUB7                         4085
#define ODCONB                        4086
#define ODCB0                         4087
#define ODCB1                         4088
#define ODCB2                         4089
#define ODCB3                         4090
#define ODCB4                         4091
#define ODCB5                         4092
#define ODCB6                         4093
#define ODCB7                         4094
#define SLRCONB                       4095
#define SLRB0                         4096
#define SLRB1                         4097
#define SLRB2                         4098
#define SLRB3                         4099
#define SLRB4                         4100
#define SLRB5                         4101
#define SLRB6                         4102
#define SLRB7                         4103
#define INLVLB                        4104
#define INLVLB0                       4105
#define INLVLB1                       4106
#define INLVLB2                       4107
#define INLVLB3                       4108
#define INLVLB4                       4109
#define INLVLB5                       4110
#define INLVLB6                       4111
#define INLVLB7                       4112
#define IOCBP                         4113
#define IOCBP0                        4114
#define IOCBP1                        4115
#define IOCBP2                        4116
#define IOCBP3                        4117
#define IOCBP4                        4118
#define IOCBP5                        4119
#define IOCBP6                        4120
#define IOCBP7                        4121
#define IOCBN                         4122
#define IOCBN0                        4123
#define IOCBN1                        4124
#define IOCBN2                        4125
#define IOCBN3                        4126
#define IOCBN4                        4127
#define IOCBN5                        4128
#define IOCBN6                        4129
#define IOCBN7                        4130
#define IOCBF                         4131
#define IOCBF0                        4132
#define IOCBF1                        4133
#define IOCBF2                        4134
#define IOCBF3                        4135
#define IOCBF4                        4136
#define IOCBF5                        4137
#define IOCBF6                        4138
#define IOCBF7                        4139
#define CCDNB                         4140
#define CCDNB0                        4141
#define CCDNB1                        4142
#define CCDNB2                        4143
#define CCDNB3                        4144
#define CCDNB4                        4145
#define CCDNB5                        4146
#define CCDNB6                        4147
#define CCDNB7                        4148
#define CCDPB                         4149
#define CCDPB0                        4150
#define CCDPB1                        4151
#define CCDPB2                        4152
#define CCDPB3                        4153
#define CCDPB4                        4154
#define CCDPB5                        4155
#define CCDPB6                        4156
#define CCDPB7                        4157
#define ANSELC                        4158
#define ANSC0                         4159
#define ANSC1                         4160
#define ANSC2                         4161
#define ANSC3                         4162
#define ANSC4                         4163
#define ANSC5                         4164
#define ANSC6                         4165
#define ANSC7                         4166
#define WPUC                          4167
#define WPUC0                         4168
#define WPUC1                         4169
#define WPUC2                         4170
#define WPUC3                         4171
#define WPUC4                         4172
#define WPUC5                         4173
#define WPUC6                         4174
#define WPUC7                         4175
#define ODCONC                        4176
#define ODCC0                         4177
#define ODCC1                         4178
#define ODCC2                         4179
#define ODCC3                         4180
#define ODCC4                         4181
#define ODCC5                         4182
#define ODCC6                         4183
#define ODCC7                         4184
#define SLRCONC                       4185
#define SLRC0                         4186
#define SLRC1                         4187
#define SLRC2                         4188
#define SLRC3                         4189
#define SLRC4                         4190
#define SLRC5                         4191
#define SLRC6                         4192
#define SLRC7                         4193
#define INLVLC                        4194
#define INLVLC0                       4195
#define INLVLC1                       4196
#define INLVLC2                       4197
#define INLVLC3                       4198
#define INLVLC4                       4199
#define INLVLC5                       4200
#define INLVLC6                       4201
#define INLVLC7                       4202
#define IOCCP                         4203
#define IOCCP0                        4204
#define IOCCP1                        4205
#define IOCCP2                        4206
#define IOCCP3                        4207
#define IOCCP4                        4208
#define IOCCP5                        4209
#define IOCCP6                        4210
#define IOCCP7                        4211
#define IOCCN                         4212
#define IOCCN0                        4213
#define IOCCN1                        4214
#define IOCCN2                        4215
#define IOCCN3                        4216
#define IOCCN4                        4217
#define IOCCN5                        4218
#define IOCCN6                        4219
#define IOCCN7                        4220
#define IOCCF                         4221
#define IOCCF0                        4222
#define IOCCF1                        4223
#define IOCCF2                        4224
#define IOCCF3                        4225
#define IOCCF4                        4226
#define IOCCF5                        4227
#define IOCCF6                        4228
#define IOCCF7                        4229
#define CCDNC                         4230
#define CCDNC0                        4231
#define CCDNC1                        4232
#define CCDNC2                        4233
#define CCDNC3                        4234
#define CCDNC4                        4235
#define CCDNC5                        4236
#define CCDNC6                        4237
#define CCDNC7                        4238
#define CCDPC                         4239
#define CCDPC0                        4240
#define CCDPC1                        4241
#define CCDPC2                        4242
#define CCDPC3                        4243
#define CCDPC4                        4244
#define CCDPC5                        4245
#define CCDPC6                        4246
#define CCDPC7                        4247
#define ANSELD                        4248
#define ANSD0                         4249
#define ANSD1                         4250
#define ANSD2                         4251
#define ANSD3                         4252
#define ANSD4                         4253
#define ANSD5                         4254
#define ANSD6                         4255
#define ANSD7                         4256
#define WPUD                          4257
#define WPUD0                         4258
#define WPUD1                         4259
#define WPUD2                         4260
#define WPUD3                         4261
#define WPUD4                         4262
#define WPUD5                         4263
#define WPUD6                         4264
#define WPUD7                         4265
#define ODCOND                        4266
#define ODCD0                         4267
#define ODCD1                         4268
#define ODCD2                         4269
#define ODCD3                         4270
#define ODCD4                         4271
#define ODCD5                         4272
#define ODCD6                         4273
#define ODCD7                         4274
#define SLRCOND                       4275
#define SLRD0                         4276
#define SLRD1                         4277
#define SLRD2                         4278
#define SLRD3                         4279
#define SLRD4                         4280
#define SLRD5                         4281
#define SLRD6                         4282
#define SLRD7                         4283
#define INLVLD                        4284
#define INLVLD0                       4285
#define INLVLD1                       4286
#define INLVLD2                       4287
#define INLVLD3                       4288
#define INLVLD4                       4289
#define INLVLD5                       4290
#define INLVLD6                       4291
#define INLVLD7                       4292
#define CCDND                         4293
#define CCDND0                        4294
#define CCDND1                        4295
#define CCDND2                        4296
#define CCDND3                        4297
#define CCDND4                        4298
#define CCDND5                        4299
#define CCDND6                        4300
#define CCDND7                        4301
#define CCDPD                         4302
#define CCDPD0                        4303
#define CCDPD1                        4304
#define CCDPD2                        4305
#define CCDPD3                        4306
#define CCDPD4                        4307
#define CCDPD5                        4308
#define CCDPD6                        4309
#define CCDPD7                        4310
#define ANSELE                        4311
#define ANSE0                         4312
#define ANSE1                         4313
#define ANSE2                         4314
#define WPUE                          4315
#define WPUE0                         4316
#define WPUE1                         4317
#define WPUE2                         4318
#define WPUE3                         4319
#define ODCONE                        4320
#define ODCE0                         4321
#define ODCE1                         4322
#define ODCE2                         4323
#define SLRCONE                       4324
#define SLRE0                         4325
#define SLRE1                         4326
#define SLRE2                         4327
#define INLVLE                        4328
#define INLVLE0                       4329
#define INLVLE1                       4330
#define INLVLE2                       4331
#define INLVLE3                       4332
#define IOCEP                         4333
#define IOCEP3                        4334
#define IOCEN                         4335
#define IOCEN3                        4336
#define IOCEF                         4337
#define IOCEF3                        4338
#define CCDNE                         4339
#define CCDNE0                        4340
#define CCDNE1                        4341
#define CCDNE2                        4342
#define CCDPE                         4343
#define CCDPE0                        4344
#define CCDPE1                        4345
#define CCDPE2                        4346
#define STATUS_SHAD                   4347
#define C_SHAD                        4348
#define DC_SHAD                       4349
#define Z_SHAD                        4350
#define WREG_SHAD                     4351
#define BSR_SHAD                      4352
#define PCLATH_SHAD                   4353
#define FSR0L_SHAD                    4354
#define FSR0H_SHAD                    4355
#define FSR1L_SHAD                    4356
#define FSR1H_SHAD                    4357
#define STKPTR                        4358
#define TOSL                          4359
#define TOSH                          4360

#endif // _PIC16LF18877_H_
